export default {
	//销售类型
	saleType: [
		{
			value: 0,
			name: "堂食",
		},
		{
			value: 1,
			name: "外卖",
		},
		{
			value: 2,
			name: "通用",
		},
	],
	couponType: {
		0: "新人券",
		1: "活动券",
		2: "分享券",
	},
	saleTypeKeys: {
		0: "堂食",
		1: "外卖",
		2: "通用",
		3: "拼餐",
	},
	shopStatus: {
		0: "休息中",
		1: "营业中",
		2: "暂停营业",
		3: "退租",
	},
	orderStatus: {
		//0:待支付,1:已取消,2:待接单,3:已接单,4:待配送(待取餐)5:配送中,6:退款中,7:退款完成,8:已完成(取餐),
		//9:退款审核,10:退款驳回,11:已接单退款,12:待配送退款,:13:配送中退款
		0: "待支付",
		1: "已取消",
		2: "待接单",
		3: "已接单",
		4: "待配送(待取餐)",
		5: "配送中",
		6: "退款中",
		7: "退款完成",
	},
	deliveryWay: {
		1: "自配送",
		2: "达达配送",
		3: "蜂鸟配送",
		4: "顺丰配送",
	},
};
